Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_LEN (10u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMSET */
#define IFX_EVADC_G_Q_REQTM_SEQTIMSET_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_REQTM_Bits.REQTS */
#define IFX_EVADC_G_Q_REQTM_REQTS_OFF (16u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_REQTM_Bits.ENTR */
#define IFX_EVADC_G_Q_REQTM_ENTR_OFF (17u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_LEN (10u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_G_Q_REQTM_Bits.SEQTIMOFF */
#define IFX_EVADC_G_Q_REQTM_SEQTIMOFF_OFF (22u)

/** \brief Length for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_LEN (10u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_G_Q_REQTS_Bits.SEQTIMER */
#define IFX_EVADC_G_Q_REQTS_SEQTIMER_OFF (6u)

/** \brief Length for Ifx_EVADC_G_CEFLAG_Bits.CEV0 */
#define IFX_EVADC_G_CEFLAG_CEV0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV0 */
#define IFX_EVADC_G_CEFLAG_CEV0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV0 */
#define IFX_EVADC_G_CEFLAG_CEV0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV1 */
#define IFX_EVADC_G_CEFLAG_CEV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFLAG_Bits.CEV2 */
#define IFX_EVADC_G_CEFLAG_CEV2_OFF (2u)

